Revit 2027 API
ProjectInfo.Number Property
Get or Set the Project Number of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Number { get; set; }
Public Property Number As String
	Get
	Set
public:
property String^ Number {
	String^ get ();
	void set (String^ value);
}
member Number : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Number of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace